frontend/views/jobinvitation/index.php

            [
				'attribute' => 'job_id',
				'value' => function($model){
					$job = \common\models\Job::find()->where(['id' => $model->job_id])->one();
---
SELECT * FROM `job` WHERE `id`=18