frontend/views/jobinvitation/talent.php

SELECT * FROM `profile` WHERE `user_id`=2
---
			[
				'attribute' => 'user_id',
				'value' => function($model){
					$user = \common\models\Profile::find()->where(['user_id' => $model->user_id])->one();

SELECT * FROM `job` WHERE `id`=11
---
            [
				'attribute' => 'job_id',
				'value' => function($model){
					$job = \common\models\Job::find()->where(['id' => $model->job_id])->one();