frontend/controllers/JobController.php

SELECT * FROM `category` WHERE `id`=3
---
    public function actionView($id)
    {
		if(!Yii::$app->user->isGuest)
		{
			$model = $this->findModel($id);
			$category = \common\models\Category::find()->where(['id' => $model->category_id])->one();

SELECT * FROM `job` WHERE `id`='17'
---
    protected function findModel($id)
    {
        if (($model = Job::findOne($id)) !== null) {