frontend/controllers/JobinvitationController.php

INSERT INTO `job_invitation` (`user_id`, `job_id`, `invitation_date`, `target_date`, `target_venue`, `description`) VALUES (2, 14, '2017-08-30', '20180419', 'Voi', 'This is a sample invitation to interview')
SELECT * FROM `job_application` WHERE `id`='5'
UPDATE `job_application` SET `invited`=1 WHERE `id`=5
---
    public function actionAccept($job_id, $user_id, $jobapplication_id)
    {
        $model = new JobInvitation();

        if ($model->load(Yii::$app->request->post()))
		{
			if($model->save())
			{
				//Update the job application as invited
				$applicationmodel = \common\models\JobApplication::findOne($jobapplication_id);
				$applicationmodel->invited = 1;
				$applicationmodel->save();

SELECT * FROM `job_invitation` WHERE `id`='5'
---
    protected function findModel($id)
    {
        if (($model = JobInvitation::findOne($id)) !== null) {