frontend/views/jobapplication/index.php

SELECT * FROM `job` WHERE `id`=3
---
			[
				'attribute' => 'job_id',
				'value' => function($model){
					$job = \common\models\Job::find()->where(['id' => $model->job_id])->one();