frontend/views/jobapplication/talent.php

			[
				'attribute' => 'user_id',
				'value' => function($model){
					$user = \common\models\Profile::find()->where(['user_id' => $model->user_id])->one();
---
SELECT * FROM `profile` WHERE `user_id`=2

			[
				'attribute' => 'job_id',
				'value' => function($model){
					$job = \common\models\Job::find()->where(['id' => $model->job_id])->one();
---
SELECT * FROM `job` WHERE `id`=17