frontend/views/profile/_search.php


    <?//= $form->field($model, 'country_id') ?>
	<?php
        $country = \common\models\Countries::find()->all();
---
SELECT * FROM `countries`