frontend/views/profile/search.php

            [
				'attribute' => 'country_id',
				'value' => function($model){
                    $country = \common\models\Countries::find()->where(['id' => $model->country_id])->one();
---
SELECT * FROM `countries` WHERE `id`=192