frontend/views/profile/view.php

	?>

	<?php
		$country = \common\models\Countries::find()->where(['id' => $model->country_id])->one();
---
SELECT * FROM `countries` WHERE `id`=192